mathews0x0/datalogger-v2/firmware_p4/firmware/sdkconfig.defaults
# ============================================================
# RaceSense ESP32-P4 Default SDK Configuration
# Target: Waveshare ESP32-P4-WIFI6-Touch-LCD-4.3
# ============================================================

# --- Chip Target ---
CONFIG_IDF_TARGET="esp32p4"

# --- Flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- PSRAM (32MB PSRAM on Waveshare board) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# --- Wi-Fi & Networking ---
# The Waveshare board routes the on-board ESP32-C6 through P4 SDMMC slot 1:
#   P4 GPIO18/19/14/15/16/17 <-> C6 SDIO CLK/CMD/D0/D1/D2/D3
#   P4 GPIO54 -> C6 CHIP_PU
# The microSD card remains on P4 SDMMC slot 0 (GPIO43/44/39-42), so both
# SDMMC peripherals can coexist.  These values match the ESP-Hosted
# P4-function-board pin profile used by the managed component.
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_TRANSPORT_RESTART_ON_FAILURE=y
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
CONFIG_RS_NETWORK_SELF_TEST=n
# RaceSense uses WPA/WPA2 personal hotspots only.
# CONFIG_ESP_WIFI_REMOTE_EAP_ENABLED is not set

# Waveshare's ESP32-P4 is revision v1.3.  ESP-IDF 5.5 defaults to the
# mutually-incompatible v3.1+ silicon family, so retain compatibility with
# the original v1.x P4 hardware.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=2048

# --- Partition Table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# The connected Waveshare board uses a 32 MB GigaDevice flash part.
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y

# --- FAT Filesystem (SDIO SD Card) ---
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y

# --- SDMMC Host (4-bit SDIO 3.0) ---
CONFIG_SOC_SDMMC_HOST_SUPPORTED=y

# --- LWIP (Networking stack for esp-hosted) ---
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_SO_RCVBUF=y

# --- HTTPS / MbedTLS ---
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# --- NTP ---
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- Watchdog ---
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_EN=y

# --- Power Management ---
CONFIG_PM_ENABLE=y

# --- LVGL Display ---
CONFIG_RS_DISPLAY_PROFILE_800_480=y
# MIPI-DSI consumes RGB565 words directly.  Byte swapping is only needed for
# the old 8-bit SPI display transport and corrupts P4 colours.
# CONFIG_LV_COLOR_16_SWAP is not set
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y
